Revit 2027 API
ScheduleDefinition.IsSchedulableField Method
 Checks whether a non-calculated/non-combined field is eligible to be included in this schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSchedulableField(
	SchedulableField schedulableField
)
Public Function IsSchedulableField (
	schedulableField As SchedulableField
) As Boolean
public:
bool IsSchedulableField(
	SchedulableField^ schedulableField
)
member IsSchedulableField :
        schedulableField : SchedulableField -> bool
Parameters
schedulableField SchedulableField
 The field to check.
Return Value
Boolean
 True if the field may be included in the schedule, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace